11a12,43
> $_ZN4EvilD2Ev = comdat any
> 
> $_ZN4EvilD0Ev = comdat any
> 
> $_ZN4Evil9makeAdminEv = comdat any
> 
> $_ZN7DerivedD0Ev = comdat any
> 
> $_ZN7Derived7printMeEv = comdat any
> 
> $_ZN4BaseD2Ev = comdat any
> 
> $_ZTV4Evil = comdat any
> 
> $_ZTS4Evil = comdat any
> 
> $_ZTI4Evil = comdat any
> 
> $_ZTV7Derived = comdat any
> 
> $_ZTS7Derived = comdat any
> 
> $_ZTS4Base = comdat any
> 
> $_ZTI4Base = comdat any
> 
> $_ZTI7Derived = comdat any
> 
> @_ZTV4Evil = linkonce_odr hidden unnamed_addr constant { [5 x ptr] } { [5 x ptr] [ptr null, ptr @_ZTI4Evil, ptr @_ZN4EvilD2Ev, ptr @_ZN4EvilD0Ev, ptr @_ZN4Evil9makeAdminEv] }, comdat, align 8, !type !0, !type !1
> @_ZTVN10__cxxabiv117__class_type_infoE = external global ptr
> @_ZTS4Evil = linkonce_odr hidden constant [6 x i8] c"4Evil\00", comdat, align 1
> @_ZTI4Evil = linkonce_odr hidden constant { ptr, ptr } { ptr getelementptr inbounds (ptr, ptr @_ZTVN10__cxxabiv117__class_type_infoE, i64 2), ptr @_ZTS4Evil }, comdat, align 8
13,15c45,53
< @.str = private unnamed_addr constant [32 x i8] c"CFI Prevents this control flow\0A\00", align 1, !dbg !0
< @.str.1 = private unnamed_addr constant [17 x i8] c"Evil::makeAdmin\0A\00", align 1, !dbg !8
< @.str.3 = private unnamed_addr constant [18 x i8] c"Derived::printMe\0A\00", align 1, !dbg !13
---
> @.str = private unnamed_addr constant [32 x i8] c"CFI Prevents this control flow\0A\00", align 1, !dbg !2

> !26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Ios_Iostate", scope: !28, file: !27, line: 154, baseType: !29, size: 32, elements: !30, identifier: "_ZTSSt12_Ios_Iostate")
> !27 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/bits/ios_base.h", directory: "")
> !28 = !DINamespace(name: "std", scope: null)
> !29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
> !30 = !{!31, !32, !33, !34, !35, !36, !37}
> !31 = !DIEnumerator(name: "_S_goodbit", value: 0)
> !32 = !DIEnumerator(name: "_S_badbit", value: 1)
> !33 = !DIEnumerator(name: "_S_eofbit", value: 2)
> !34 = !DIEnumerator(name: "_S_failbit", value: 4)
> !35 = !DIEnumerator(name: "_S_ios_iostate_end", value: 65536)
> !36 = !DIEnumerator(name: "_S_ios_iostate_max", value: 2147483647)
> !37 = !DIEnumerator(name: "_S_ios_iostate_min", value: -2147483648)
> !38 = !{!39, !62, !26, !29, !67}
> !39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
> !40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Derived", file: !4, line: 11, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !41, vtableHolder: !43, identifier: "_ZTS7Derived")
> !41 = !{!42, !56, !60, !61}
> !42 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !40, baseType: !43, extraData: i32 0)
> !43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !4, line: 4, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !44, vtableHolder: !43, identifier: "_ZTS4Base")
> !44 = !{!45, !50, !54, !55}
> !45 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$Base", scope: !4, file: !4, baseType: !46, size: 64, flags: DIFlagArtificial)
> !46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
> !47 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !48, size: 64)
> !48 = !DISubroutineType(types: !49)
> !49 = !{!29}
> !50 = !DISubprogram(name: "Base", scope: !43, file: !4, line: 5, type: !51, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
107,267c226,386
< !53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
< !54 = !DISubprogram(name: "~Derived", scope: !34, file: !2, line: 13, type: !51, scopeLine: 13, containingType: !34, virtualIndex: 0, flags: DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
< !55 = !DISubprogram(name: "printMe", linkageName: "_ZN7Derived7printMeEv", scope: !34, file: !2, line: 15, type: !51, scopeLine: 15, containingType: !34, virtualIndex: 2, flags: DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
< !56 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !22, file: !57, line: 68, baseType: !58)
< !57 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/bits/postypes.h", directory: "")
< !58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !22, file: !59, line: 309, baseType: !60)
< !59 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/x86_64-pc-linux-gnu/bits/c++config.h", directory: "", checksumkind: CSK_MD5, checksum: "76c5c37f04111cf76d9fd4e93d503f31")
< !60 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
< !61 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !22, file: !21, line: 233, size: 1728, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt8ios_base")
< !62 = !{!0, !8, !63, !13}
< !63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
< !64 = distinct !DIGlobalVariable(scope: null, file: !2, line: 8, type: !65, isLocal: true, isDefinition: true)
< !65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !66)
< !66 = !{!67}
< !67 = !DISubrange(count: 15)
< !68 = !{!69, !87, !90, !95, !159, !167, !171, !178, !182, !186, !188, !190, !194, !202, !206, !212, !218, !220, !224, !228, !232, !236, !248, !250, !254, !258, !262, !264, !269, !273, !277, !279, !281, !285, !293, !297, !301, !305, !307, !313, !315, !322, !327, !331, !335, !339, !343, !347, !349, !351, !355, !359, !363, !365, !369, !373, !375, !377, !381, !387, !392, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !415, !420, !424, !428, !433, !439, !441, !443, !445, !447, !449, !451, !453, !455, !457, !459, !461, !463, !465, !469, !473, !477, !483, !487, !491, !496, !498, !503, !507, !511, !522, !524, !528, !532, !536, !540, !544, !548, !552, !556, !560, !564, !568, !570, !572, !576, !580, !586, !590, !594, !596, !600, !604, !610, !612, !616, !620, !624, !628, !632, !636, !640, !641, !642, !643, !645, !646, !647, !648, !649, !650, !651, !655, !661, !666, !670, !672, !674, !676, !678, !685, !689, !693, !697, !701, !705, !710, !714, !716, !720, !726, !730, !735, !737, !740, !744, !748, !750, !752, !754, !756, !760, !762, !764, !768, !772, !776, !780, !784, !788, !790, !794, !798, !802, !806, !808, !810, !814, !818, !819, !820, !821, !822, !823, !831, !838, !841, !842, !844, !846, !848, !850, !854, !856, !858, !860, !862, !864, !866, !868, !870, !874, !878, !880, !884}
< !69 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !70, file: !86, line: 64)
< !70 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !71, line: 6, baseType: !72)
< !71 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
< !72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !73, line: 21, baseType: !74)
< !73 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
< !74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !75, identifier: "_ZTS11__mbstate_t")
< !75 = !{!76, !77}
< !76 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !74, file: !73, line: 15, baseType: !23, size: 32)
< !77 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !74, file: !73, line: 20, baseType: !78, size: 32, offset: 32)
< !78 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !73, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTSN11__mbstate_tUt_E")
< !79 = !{!80, !82}
< !80 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !78, file: !73, line: 18, baseType: !81, size: 32)
< !81 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
< !82 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !78, file: !73, line: 19, baseType: !83, size: 32)
< !83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, elements: !84)
< !84 = !{!85}
< !85 = !DISubrange(count: 4)
< !86 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/cwchar", directory: "")
< !87 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !88, file: !86, line: 141)
< !88 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !89, line: 20, baseType: !81)
< !89 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
< !90 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !91, file: !86, line: 143)
< !91 = !DISubprogram(name: "btowc", scope: !92, file: !92, line: 319, type: !93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !92 = !DIFile(filename: "/usr/include/wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "7dacda51047d2b210109ddd1a983e48e")
< !93 = !DISubroutineType(types: !94)
< !94 = !{!88, !23}
< !95 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !96, file: !86, line: 144)
< !96 = !DISubprogram(name: "fgetwc", scope: !92, file: !92, line: 744, type: !97, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !97 = !DISubroutineType(types: !98)
< !98 = !{!88, !99}
< !99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
< !100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !101, line: 5, baseType: !102)
< !101 = !DIFile(filename: "/usr/include/bits/types/__FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "72a8fe90981f484acae7c6f3dfc5c2b7")
< !102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !103, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !104, identifier: "_ZTS8_IO_FILE")
< !103 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "2724c33532a91348c643429afa072d1a")
< !104 = !{!105, !106, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !121, !123, !124, !125, !128, !130, !132, !136, !139, !141, !144, !147, !148, !150, !154, !155}
< !105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !102, file: !103, line: 51, baseType: !23, size: 32)
< !106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !102, file: !103, line: 54, baseType: !107, size: 64, offset: 64)
< !107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
< !108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !102, file: !103, line: 55, baseType: !107, size: 64, offset: 128)
< !109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !102, file: !103, line: 56, baseType: !107, size: 64, offset: 192)
< !110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !102, file: !103, line: 57, baseType: !107, size: 64, offset: 256)
< !111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !102, file: !103, line: 58, baseType: !107, size: 64, offset: 320)
< !112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !102, file: !103, line: 59, baseType: !107, size: 64, offset: 384)
< !113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !102, file: !103, line: 60, baseType: !107, size: 64, offset: 448)
< !114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !102, file: !103, line: 61, baseType: !107, size: 64, offset: 512)
< !115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !102, file: !103, line: 64, baseType: !107, size: 64, offset: 576)
< !116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !102, file: !103, line: 65, baseType: !107, size: 64, offset: 640)
< !117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !102, file: !103, line: 66, baseType: !107, size: 64, offset: 704)
< !118 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !102, file: !103, line: 68, baseType: !119, size: 64, offset: 768)
< !119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
< !120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !103, line: 36, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS10_IO_marker")
< !121 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !102, file: !103, line: 70, baseType: !122, size: 64, offset: 832)
< !122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
< !123 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !102, file: !103, line: 72, baseType: !23, size: 32, offset: 896)
< !124 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !102, file: !103, line: 73, baseType: !23, size: 32, offset: 928)
< !125 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !102, file: !103, line: 74, baseType: !126, size: 64, offset: 960)
< !126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !127, line: 152, baseType: !60)
< !127 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "4a64d909bcfa62a0a7682c3ac78c6965")
< !128 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !102, file: !103, line: 77, baseType: !129, size: 16, offset: 1024)
< !129 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
< !130 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !102, file: !103, line: 78, baseType: !131, size: 8, offset: 1040)
< !131 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
< !132 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !102, file: !103, line: 79, baseType: !133, size: 8, offset: 1048)
< !133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, elements: !134)
< !134 = !{!135}
< !135 = !DISubrange(count: 1)
< !136 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !102, file: !103, line: 81, baseType: !137, size: 64, offset: 1088)
< !137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
< !138 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !103, line: 43, baseType: null)
< !139 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !102, file: !103, line: 89, baseType: !140, size: 64, offset: 1152)
< !140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !127, line: 153, baseType: !60)
< !141 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !102, file: !103, line: 91, baseType: !142, size: 64, offset: 1216)
< !142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
< !143 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !103, line: 37, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS11_IO_codecvt")
< !144 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !102, file: !103, line: 92, baseType: !145, size: 64, offset: 1280)
< !145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
< !146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !103, line: 38, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13_IO_wide_data")
< !147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !102, file: !103, line: 93, baseType: !122, size: 64, offset: 1344)
< !148 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !102, file: !103, line: 94, baseType: !149, size: 64, offset: 1408)
< !149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
< !150 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !102, file: !103, line: 95, baseType: !151, size: 64, offset: 1472)
< !151 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 46, baseType: !153)
< !152 = !DIFile(filename: "build/packages/llvm-16.0.1/install/lib/clang/16/include/stddef.h", directory: "/home/max/University/VU_Amsterdam/Year_3/Thesis/VUSec_inSPECtion", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
< !153 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
< !154 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !102, file: !103, line: 96, baseType: !23, size: 32, offset: 1536)
< !155 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !102, file: !103, line: 98, baseType: !156, size: 160, offset: 1568)
< !156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, elements: !157)
< !157 = !{!158}
< !158 = !DISubrange(count: 20)
< !159 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !160, file: !86, line: 145)
< !160 = !DISubprogram(name: "fgetws", scope: !92, file: !92, line: 773, type: !161, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !161 = !DISubroutineType(types: !162)
< !162 = !{!163, !165, !23, !166}
< !163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
< !164 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
< !165 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !163)
< !166 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !99)
< !167 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !168, file: !86, line: 146)
< !168 = !DISubprogram(name: "fputwc", scope: !92, file: !92, line: 758, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !169 = !DISubroutineType(types: !170)
< !170 = !{!88, !164, !99}
< !171 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !172, file: !86, line: 147)
< !172 = !DISubprogram(name: "fputws", scope: !92, file: !92, line: 780, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !173 = !DISubroutineType(types: !174)
< !174 = !{!23, !175, !166}
< !175 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !176)
< !176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
< !177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
< !178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !179, file: !86, line: 148)
< !179 = !DISubprogram(name: "fwide", scope: !92, file: !92, line: 588, type: !180, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !180 = !DISubroutineType(types: !181)
< !181 = !{!23, !99, !23}
< !182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !183, file: !86, line: 149)
< !183 = !DISubprogram(name: "fwprintf", scope: !92, file: !92, line: 595, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !184 = !DISubroutineType(types: !185)
< !185 = !{!23, !166, !175, null}
< !186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !187, file: !86, line: 150)
< !187 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !92, file: !92, line: 657, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !188 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !189, file: !86, line: 151)
< !189 = !DISubprogram(name: "getwc", scope: !92, file: !92, line: 745, type: !97, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !191, file: !86, line: 152)
< !191 = !DISubprogram(name: "getwchar", scope: !92, file: !92, line: 751, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !192 = !DISubroutineType(types: !193)
< !193 = !{!88}
< !194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !195, file: !86, line: 153)
< !195 = !DISubprogram(name: "mbrlen", scope: !92, file: !92, line: 330, type: !196, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !196 = !DISubroutineType(types: !197)
< !197 = !{!151, !198, !151, !200}
< !198 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !199)
< !199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
< !200 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !201)
< !201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
< !202 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !203, file: !86, line: 154)
< !203 = !DISubprogram(name: "mbrtowc", scope: !92, file: !92, line: 297, type: !204, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !204 = !DISubroutineType(types: !205)
< !205 = !{!151, !165, !198, !151, !200}
< !206 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !207, file: !86, line: 155)
< !207 = !DISubprogram(name: "mbsinit", scope: !92, file: !92, line: 293, type: !208, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !208 = !DISubroutineType(types: !209)
< !209 = !{!23, !210}
< !210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
< !211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
< !212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !213, file: !86, line: 156)
< !213 = !DISubprogram(name: "mbsrtowcs", scope: !92, file: !92, line: 338, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
---
> !53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
> !54 = !DISubprogram(name: "~Base", scope: !43, file: !4, line: 6, type: !51, scopeLine: 6, containingType: !43, virtualIndex: 0, flags: DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
> !55 = !DISubprogram(name: "printMe", linkageName: "_ZN4Base7printMeEv", scope: !43, file: !4, line: 8, type: !51, scopeLine: 8, containingType: !43, virtualIndex: 2, flags: DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
> !56 = !DISubprogram(name: "Derived", scope: !40, file: !4, line: 12, type: !57, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !57 = !DISubroutineType(types: !58)
> !58 = !{null, !59}
> !59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
> !60 = !DISubprogram(name: "~Derived", scope: !40, file: !4, line: 13, type: !57, scopeLine: 13, containingType: !40, virtualIndex: 0, flags: DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
> !61 = !DISubprogram(name: "printMe", linkageName: "_ZN7Derived7printMeEv", scope: !40, file: !4, line: 15, type: !57, scopeLine: 15, containingType: !40, virtualIndex: 2, flags: DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
> !62 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !28, file: !63, line: 68, baseType: !64)
> !63 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/bits/postypes.h", directory: "")
> !64 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !28, file: !65, line: 309, baseType: !66)
> !65 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/x86_64-pc-linux-gnu/bits/c++config.h", directory: "", checksumkind: CSK_MD5, checksum: "76c5c37f04111cf76d9fd4e93d503f31")
> !66 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
> !67 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !28, file: !27, line: 233, size: 1728, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSSt8ios_base")
> !68 = !{!2, !10, !69, !19}
> !69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
> !70 = distinct !DIGlobalVariable(scope: null, file: !4, line: 8, type: !71, isLocal: true, isDefinition: true)
> !71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 120, elements: !72)
> !72 = !{!73}
> !73 = !DISubrange(count: 15)
> !74 = !{!75, !93, !96, !101, !165, !173, !177, !184, !188, !192, !194, !196, !200, !208, !212, !218, !224, !226, !230, !234, !238, !242, !254, !256, !260, !264, !268, !270, !275, !279, !283, !285, !287, !291, !299, !303, !307, !311, !313, !319, !321, !328, !333, !337, !341, !345, !349, !353, !355, !357, !361, !365, !369, !371, !375, !379, !381, !383, !387, !393, !398, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !417, !421, !426, !430, !434, !439, !445, !447, !449, !451, !453, !455, !457, !459, !461, !463, !465, !467, !469, !471, !475, !479, !483, !489, !493, !497, !502, !504, !509, !513, !517, !528, !530, !534, !538, !542, !546, !550, !554, !558, !562, !566, !570, !574, !576, !578, !582, !586, !592, !596, !600, !602, !606, !610, !616, !618, !622, !626, !630, !634, !638, !642, !646, !647, !648, !649, !651, !652, !653, !654, !655, !656, !657, !661, !667, !672, !676, !678, !680, !682, !684, !691, !695, !699, !703, !707, !711, !716, !720, !722, !726, !732, !736, !741, !743, !746, !750, !754, !756, !758, !760, !762, !766, !768, !770, !774, !778, !782, !786, !790, !794, !796, !800, !804, !808, !812, !814, !816, !820, !824, !825, !826, !827, !828, !829, !837, !844, !847, !848, !850, !852, !854, !856, !860, !862, !864, !866, !868, !870, !872, !874, !876, !880, !884, !886, !890}
> !75 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !76, file: !92, line: 64)
> !76 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !77, line: 6, baseType: !78)
> !77 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
> !78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !79, line: 21, baseType: !80)
> !79 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
> !80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !81, identifier: "_ZTS11__mbstate_t")
> !81 = !{!82, !83}
> !82 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !80, file: !79, line: 15, baseType: !29, size: 32)
> !83 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !80, file: !79, line: 20, baseType: !84, size: 32, offset: 32)
> !84 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !79, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !85, identifier: "_ZTSN11__mbstate_tUt_E")
> !85 = !{!86, !88}
> !86 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !84, file: !79, line: 18, baseType: !87, size: 32)
> !87 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
> !88 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !84, file: !79, line: 19, baseType: !89, size: 32)
> !89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !90)
> !90 = !{!91}
> !91 = !DISubrange(count: 4)
> !92 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/cwchar", directory: "")
> !93 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !94, file: !92, line: 141)
> !94 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !95, line: 20, baseType: !87)
> !95 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
> !96 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !97, file: !92, line: 143)
> !97 = !DISubprogram(name: "btowc", scope: !98, file: !98, line: 319, type: !99, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !98 = !DIFile(filename: "/usr/include/wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "7dacda51047d2b210109ddd1a983e48e")
> !99 = !DISubroutineType(types: !100)
> !100 = !{!94, !29}
> !101 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !102, file: !92, line: 144)
> !102 = !DISubprogram(name: "fgetwc", scope: !98, file: !98, line: 744, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !103 = !DISubroutineType(types: !104)
> !104 = !{!94, !105}
> !105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
> !106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !107, line: 5, baseType: !108)
> !107 = !DIFile(filename: "/usr/include/bits/types/__FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "72a8fe90981f484acae7c6f3dfc5c2b7")
> !108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !109, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !110, identifier: "_ZTS8_IO_FILE")
> !109 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "2724c33532a91348c643429afa072d1a")
> !110 = !{!111, !112, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !127, !129, !130, !131, !134, !136, !138, !142, !145, !147, !150, !153, !154, !156, !160, !161}
> !111 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !108, file: !109, line: 51, baseType: !29, size: 32)
> !112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !108, file: !109, line: 54, baseType: !113, size: 64, offset: 64)
> !113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
> !114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !108, file: !109, line: 55, baseType: !113, size: 64, offset: 128)
> !115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !108, file: !109, line: 56, baseType: !113, size: 64, offset: 192)
> !116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !108, file: !109, line: 57, baseType: !113, size: 64, offset: 256)
> !117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !108, file: !109, line: 58, baseType: !113, size: 64, offset: 320)
> !118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !108, file: !109, line: 59, baseType: !113, size: 64, offset: 384)
> !119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !108, file: !109, line: 60, baseType: !113, size: 64, offset: 448)
> !120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !108, file: !109, line: 61, baseType: !113, size: 64, offset: 512)
> !121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !108, file: !109, line: 64, baseType: !113, size: 64, offset: 576)
> !122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !108, file: !109, line: 65, baseType: !113, size: 64, offset: 640)
> !123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !108, file: !109, line: 66, baseType: !113, size: 64, offset: 704)
> !124 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !108, file: !109, line: 68, baseType: !125, size: 64, offset: 768)
> !125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
> !126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !109, line: 36, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS10_IO_marker")
> !127 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !108, file: !109, line: 70, baseType: !128, size: 64, offset: 832)
> !128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
> !129 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !108, file: !109, line: 72, baseType: !29, size: 32, offset: 896)
> !130 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !108, file: !109, line: 73, baseType: !29, size: 32, offset: 928)
> !131 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !108, file: !109, line: 74, baseType: !132, size: 64, offset: 960)
> !132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !133, line: 152, baseType: !66)
> !133 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "4a64d909bcfa62a0a7682c3ac78c6965")
> !134 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !108, file: !109, line: 77, baseType: !135, size: 16, offset: 1024)
> !135 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
> !136 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !108, file: !109, line: 78, baseType: !137, size: 8, offset: 1040)
> !137 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
> !138 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !108, file: !109, line: 79, baseType: !139, size: 8, offset: 1048)
> !139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !140)
> !140 = !{!141}
> !141 = !DISubrange(count: 1)
> !142 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !108, file: !109, line: 81, baseType: !143, size: 64, offset: 1088)
> !143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
> !144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !109, line: 43, baseType: null)
> !145 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !108, file: !109, line: 89, baseType: !146, size: 64, offset: 1152)
> !146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !133, line: 153, baseType: !66)
> !147 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !108, file: !109, line: 91, baseType: !148, size: 64, offset: 1216)
> !148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
> !149 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !109, line: 37, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS11_IO_codecvt")
> !150 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !108, file: !109, line: 92, baseType: !151, size: 64, offset: 1280)
> !151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
> !152 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !109, line: 38, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS13_IO_wide_data")
> !153 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !108, file: !109, line: 93, baseType: !128, size: 64, offset: 1344)
> !154 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !108, file: !109, line: 94, baseType: !155, size: 64, offset: 1408)
> !155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
> !156 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !108, file: !109, line: 95, baseType: !157, size: 64, offset: 1472)
> !157 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !158, line: 46, baseType: !159)
> !158 = !DIFile(filename: "build/packages/llvm-16.0.1/install/lib/clang/16/include/stddef.h", directory: "/home/max/University/VU_Amsterdam/Year_3/Thesis/VUSec_inSPECtion", checksumkind: CSK_MD5, checksum: "f95079da609b0e8f201cb8136304bf3b")
> !159 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
> !160 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !108, file: !109, line: 96, baseType: !29, size: 32, offset: 1536)
> !161 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !108, file: !109, line: 98, baseType: !162, size: 160, offset: 1568)
> !162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !163)
> !163 = !{!164}
> !164 = !DISubrange(count: 20)
> !165 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !166, file: !92, line: 145)
> !166 = !DISubprogram(name: "fgetws", scope: !98, file: !98, line: 773, type: !167, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !167 = !DISubroutineType(types: !168)
> !168 = !{!169, !171, !29, !172}
> !169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
> !170 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
> !171 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !169)
> !172 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !105)
> !173 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !174, file: !92, line: 146)
> !174 = !DISubprogram(name: "fputwc", scope: !98, file: !98, line: 758, type: !175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !175 = !DISubroutineType(types: !176)
> !176 = !{!94, !170, !105}
> !177 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !178, file: !92, line: 147)
> !178 = !DISubprogram(name: "fputws", scope: !98, file: !98, line: 780, type: !179, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !179 = !DISubroutineType(types: !180)
> !180 = !{!29, !181, !172}
> !181 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !182)
> !182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
> !183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
> !184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !185, file: !92, line: 148)
> !185 = !DISubprogram(name: "fwide", scope: !98, file: !98, line: 588, type: !186, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !186 = !DISubroutineType(types: !187)
> !187 = !{!29, !105, !29}
> !188 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !189, file: !92, line: 149)
> !189 = !DISubprogram(name: "fwprintf", scope: !98, file: !98, line: 595, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !190 = !DISubroutineType(types: !191)
> !191 = !{!29, !172, !181, null}
> !192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !193, file: !92, line: 150)
> !193 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !98, file: !98, line: 657, type: !190, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !195, file: !92, line: 151)
> !195 = !DISubprogram(name: "getwc", scope: !98, file: !98, line: 745, type: !103, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !196 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !197, file: !92, line: 152)
> !197 = !DISubprogram(name: "getwchar", scope: !98, file: !98, line: 751, type: !198, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !198 = !DISubroutineType(types: !199)
> !199 = !{!94}
> !200 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !201, file: !92, line: 153)
> !201 = !DISubprogram(name: "mbrlen", scope: !98, file: !98, line: 330, type: !202, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !202 = !DISubroutineType(types: !203)
> !203 = !{!157, !204, !157, !206}
> !204 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !205)
> !205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
> !206 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !207)
> !207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
> !208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !209, file: !92, line: 154)
> !209 = !DISubprogram(name: "mbrtowc", scope: !98, file: !98, line: 297, type: !210, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !210 = !DISubroutineType(types: !211)
> !211 = !{!157, !171, !204, !157, !206}
> !212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !213, file: !92, line: 155)
> !213 = !DISubprogram(name: "mbsinit", scope: !98, file: !98, line: 293, type: !214, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
269,319c388,438
< !215 = !{!151, !165, !216, !151, !200}
< !216 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !217)
< !217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
< !218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !219, file: !86, line: 157)
< !219 = !DISubprogram(name: "putwc", scope: !92, file: !92, line: 759, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !220 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !221, file: !86, line: 158)
< !221 = !DISubprogram(name: "putwchar", scope: !92, file: !92, line: 765, type: !222, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !222 = !DISubroutineType(types: !223)
< !223 = !{!88, !164}
< !224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !225, file: !86, line: 160)
< !225 = !DISubprogram(name: "swprintf", scope: !92, file: !92, line: 605, type: !226, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !226 = !DISubroutineType(types: !227)
< !227 = !{!23, !165, !151, !175, null}
< !228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !229, file: !86, line: 162)
< !229 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !92, file: !92, line: 664, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !230 = !DISubroutineType(types: !231)
< !231 = !{!23, !175, !175, null}
< !232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !233, file: !86, line: 163)
< !233 = !DISubprogram(name: "ungetwc", scope: !92, file: !92, line: 788, type: !234, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !234 = !DISubroutineType(types: !235)
< !235 = !{!88, !88, !99}
< !236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !237, file: !86, line: 164)
< !237 = !DISubprogram(name: "vfwprintf", scope: !92, file: !92, line: 613, type: !238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !238 = !DISubroutineType(types: !239)
< !239 = !{!23, !166, !175, !240}
< !240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
< !241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !242, identifier: "_ZTS13__va_list_tag")
< !242 = !{!243, !245, !246, !247}
< !243 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !241, file: !244, baseType: !81, size: 32)
< !244 = !DIFile(filename: "examples/cfi.cpp", directory: "/home/max/University/VU_Amsterdam/Year_3/Thesis/VUSec_inSPECtion")
< !245 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !241, file: !244, baseType: !81, size: 32, offset: 32)
< !246 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !241, file: !244, baseType: !149, size: 64, offset: 64)
< !247 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !241, file: !244, baseType: !149, size: 64, offset: 128)
< !248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !249, file: !86, line: 166)
< !249 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !92, file: !92, line: 711, type: !238, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !251, file: !86, line: 169)
< !251 = !DISubprogram(name: "vswprintf", scope: !92, file: !92, line: 626, type: !252, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !252 = !DISubroutineType(types: !253)
< !253 = !{!23, !165, !151, !175, !240}
< !254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !255, file: !86, line: 172)
< !255 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !92, file: !92, line: 718, type: !256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !256 = !DISubroutineType(types: !257)
< !257 = !{!23, !175, !175, !240}
< !258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !259, file: !86, line: 174)
< !259 = !DISubprogram(name: "vwprintf", scope: !92, file: !92, line: 621, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !260 = !DISubroutineType(types: !261)
< !261 = !{!23, !175, !240}
< !262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !263, file: !86, line: 176)
< !263 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !92, file: !92, line: 715, type: !260, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !265, file: !86, line: 178)
< !265 = !DISubprogram(name: "wcrtomb", scope: !92, file: !92, line: 302, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
---
> !215 = !{!29, !216}
> !216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
> !217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
> !218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !219, file: !92, line: 156)
> !219 = !DISubprogram(name: "mbsrtowcs", scope: !98, file: !98, line: 338, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !220 = !DISubroutineType(types: !221)
> !221 = !{!157, !171, !222, !157, !206}
> !222 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !223)
> !223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
> !224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !225, file: !92, line: 157)
> !225 = !DISubprogram(name: "putwc", scope: !98, file: !98, line: 759, type: !175, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !226 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !227, file: !92, line: 158)
> !227 = !DISubprogram(name: "putwchar", scope: !98, file: !98, line: 765, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !228 = !DISubroutineType(types: !229)
> !229 = !{!94, !170}
> !230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !231, file: !92, line: 160)
> !231 = !DISubprogram(name: "swprintf", scope: !98, file: !98, line: 605, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !232 = !DISubroutineType(types: !233)
> !233 = !{!29, !171, !157, !181, null}
> !234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !235, file: !92, line: 162)
> !235 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !98, file: !98, line: 664, type: !236, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !236 = !DISubroutineType(types: !237)
> !237 = !{!29, !181, !181, null}
> !238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !239, file: !92, line: 163)
> !239 = !DISubprogram(name: "ungetwc", scope: !98, file: !98, line: 788, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !240 = !DISubroutineType(types: !241)
> !241 = !{!94, !94, !105}
> !242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !243, file: !92, line: 164)
> !243 = !DISubprogram(name: "vfwprintf", scope: !98, file: !98, line: 613, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !244 = !DISubroutineType(types: !245)
> !245 = !{!29, !172, !181, !246}
> !246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
> !247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !248, identifier: "_ZTS13__va_list_tag")
> !248 = !{!249, !251, !252, !253}
> !249 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !247, file: !250, baseType: !87, size: 32)
> !250 = !DIFile(filename: "examples/cfi.cpp", directory: "/home/max/University/VU_Amsterdam/Year_3/Thesis/VUSec_inSPECtion")
> !251 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !247, file: !250, baseType: !87, size: 32, offset: 32)
> !252 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !247, file: !250, baseType: !155, size: 64, offset: 64)
> !253 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !247, file: !250, baseType: !155, size: 64, offset: 128)
> !254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !255, file: !92, line: 166)
> !255 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !98, file: !98, line: 711, type: !244, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !257, file: !92, line: 169)
> !257 = !DISubprogram(name: "vswprintf", scope: !98, file: !98, line: 626, type: !258, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !258 = !DISubroutineType(types: !259)
> !259 = !{!29, !171, !157, !181, !246}
> !260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !261, file: !92, line: 172)
> !261 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !98, file: !98, line: 718, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !262 = !DISubroutineType(types: !263)
> !263 = !{!29, !181, !181, !246}
> !264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !265, file: !92, line: 174)
> !265 = !DISubprogram(name: "vwprintf", scope: !98, file: !98, line: 621, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
321,362c440,481
< !267 = !{!151, !268, !164, !200}
< !268 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
< !269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !270, file: !86, line: 179)
< !270 = !DISubprogram(name: "wcscat", scope: !92, file: !92, line: 97, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !271 = !DISubroutineType(types: !272)
< !272 = !{!163, !165, !175}
< !273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !274, file: !86, line: 180)
< !274 = !DISubprogram(name: "wcscmp", scope: !92, file: !92, line: 106, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !275 = !DISubroutineType(types: !276)
< !276 = !{!23, !176, !176}
< !277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !278, file: !86, line: 181)
< !278 = !DISubprogram(name: "wcscoll", scope: !92, file: !92, line: 131, type: !275, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !280, file: !86, line: 182)
< !280 = !DISubprogram(name: "wcscpy", scope: !92, file: !92, line: 87, type: !271, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !282, file: !86, line: 183)
< !282 = !DISubprogram(name: "wcscspn", scope: !92, file: !92, line: 188, type: !283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !283 = !DISubroutineType(types: !284)
< !284 = !{!151, !176, !176}
< !285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !286, file: !86, line: 184)
< !286 = !DISubprogram(name: "wcsftime", scope: !92, file: !92, line: 852, type: !287, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !287 = !DISubroutineType(types: !288)
< !288 = !{!151, !165, !151, !175, !289}
< !289 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !290)
< !290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
< !291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
< !292 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !92, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
< !293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !294, file: !86, line: 185)
< !294 = !DISubprogram(name: "wcslen", scope: !92, file: !92, line: 223, type: !295, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !295 = !DISubroutineType(types: !296)
< !296 = !{!151, !176}
< !297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !298, file: !86, line: 186)
< !298 = !DISubprogram(name: "wcsncat", scope: !92, file: !92, line: 101, type: !299, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !299 = !DISubroutineType(types: !300)
< !300 = !{!163, !165, !175, !151}
< !301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !302, file: !86, line: 187)
< !302 = !DISubprogram(name: "wcsncmp", scope: !92, file: !92, line: 109, type: !303, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !303 = !DISubroutineType(types: !304)
< !304 = !{!23, !176, !176, !151}
< !305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !306, file: !86, line: 188)
< !306 = !DISubprogram(name: "wcsncpy", scope: !92, file: !92, line: 92, type: !299, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !308, file: !86, line: 189)
< !308 = !DISubprogram(name: "wcsrtombs", scope: !92, file: !92, line: 344, type: !309, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
---
> !267 = !{!29, !181, !246}
> !268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !269, file: !92, line: 176)
> !269 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !98, file: !98, line: 715, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !271, file: !92, line: 178)
> !271 = !DISubprogram(name: "wcrtomb", scope: !98, file: !98, line: 302, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !272 = !DISubroutineType(types: !273)
> !273 = !{!157, !274, !170, !206}
> !274 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !113)
> !275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !276, file: !92, line: 179)
> !276 = !DISubprogram(name: "wcscat", scope: !98, file: !98, line: 97, type: !277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !277 = !DISubroutineType(types: !278)
> !278 = !{!169, !171, !181}
> !279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !280, file: !92, line: 180)
> !280 = !DISubprogram(name: "wcscmp", scope: !98, file: !98, line: 106, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !281 = !DISubroutineType(types: !282)
> !282 = !{!29, !182, !182}
> !283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !284, file: !92, line: 181)
> !284 = !DISubprogram(name: "wcscoll", scope: !98, file: !98, line: 131, type: !281, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !286, file: !92, line: 182)
> !286 = !DISubprogram(name: "wcscpy", scope: !98, file: !98, line: 87, type: !277, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !288, file: !92, line: 183)
> !288 = !DISubprogram(name: "wcscspn", scope: !98, file: !98, line: 188, type: !289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !289 = !DISubroutineType(types: !290)
> !290 = !{!157, !182, !182}
> !291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !292, file: !92, line: 184)
> !292 = !DISubprogram(name: "wcsftime", scope: !98, file: !98, line: 852, type: !293, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !293 = !DISubroutineType(types: !294)
> !294 = !{!157, !171, !157, !181, !295}
> !295 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !296)
> !296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
> !297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
> !298 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !98, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
> !299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !300, file: !92, line: 185)
> !300 = !DISubprogram(name: "wcslen", scope: !98, file: !98, line: 223, type: !301, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !301 = !DISubroutineType(types: !302)
> !302 = !{!157, !182}
> !303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !304, file: !92, line: 186)
> !304 = !DISubprogram(name: "wcsncat", scope: !98, file: !98, line: 101, type: !305, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !305 = !DISubroutineType(types: !306)
> !306 = !{!169, !171, !181, !157}
> !307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !308, file: !92, line: 187)
> !308 = !DISubprogram(name: "wcsncmp", scope: !98, file: !98, line: 109, type: !309, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
364,420c483,539
< !310 = !{!151, !268, !311, !151, !200}
< !311 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !312)
< !312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
< !313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !314, file: !86, line: 190)
< !314 = !DISubprogram(name: "wcsspn", scope: !92, file: !92, line: 192, type: !283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !316, file: !86, line: 191)
< !316 = !DISubprogram(name: "wcstod", scope: !92, file: !92, line: 378, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !317 = !DISubroutineType(types: !318)
< !318 = !{!319, !175, !320}
< !319 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
< !320 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !321)
< !321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
< !322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !323, file: !86, line: 193)
< !323 = !DISubprogram(name: "wcstof", scope: !92, file: !92, line: 383, type: !324, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !324 = !DISubroutineType(types: !325)
< !325 = !{!326, !175, !320}
< !326 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
< !327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !328, file: !86, line: 195)
< !328 = !DISubprogram(name: "wcstok", scope: !92, file: !92, line: 218, type: !329, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !329 = !DISubroutineType(types: !330)
< !330 = !{!163, !165, !175, !320}
< !331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !332, file: !86, line: 196)
< !332 = !DISubprogram(name: "wcstol", scope: !92, file: !92, line: 429, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !333 = !DISubroutineType(types: !334)
< !334 = !{!60, !175, !320, !23}
< !335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !336, file: !86, line: 197)
< !336 = !DISubprogram(name: "wcstoul", scope: !92, file: !92, line: 434, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !337 = !DISubroutineType(types: !338)
< !338 = !{!153, !175, !320, !23}
< !339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !340, file: !86, line: 198)
< !340 = !DISubprogram(name: "wcsxfrm", scope: !92, file: !92, line: 135, type: !341, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !341 = !DISubroutineType(types: !342)
< !342 = !{!151, !165, !175, !151}
< !343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !344, file: !86, line: 199)
< !344 = !DISubprogram(name: "wctob", scope: !92, file: !92, line: 325, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !345 = !DISubroutineType(types: !346)
< !346 = !{!23, !88}
< !347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !348, file: !86, line: 200)
< !348 = !DISubprogram(name: "wmemcmp", scope: !92, file: !92, line: 259, type: !303, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !350, file: !86, line: 201)
< !350 = !DISubprogram(name: "wmemcpy", scope: !92, file: !92, line: 263, type: !299, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !352, file: !86, line: 202)
< !352 = !DISubprogram(name: "wmemmove", scope: !92, file: !92, line: 268, type: !353, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !353 = !DISubroutineType(types: !354)
< !354 = !{!163, !163, !176, !151}
< !355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !356, file: !86, line: 203)
< !356 = !DISubprogram(name: "wmemset", scope: !92, file: !92, line: 272, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !357 = !DISubroutineType(types: !358)
< !358 = !{!163, !163, !164, !151}
< !359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !360, file: !86, line: 204)
< !360 = !DISubprogram(name: "wprintf", scope: !92, file: !92, line: 602, type: !361, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !361 = !DISubroutineType(types: !362)
< !362 = !{!23, !175, null}
< !363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !364, file: !86, line: 205)
< !364 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !92, file: !92, line: 661, type: !361, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !366, file: !86, line: 206)
< !366 = !DISubprogram(name: "wcschr", scope: !92, file: !92, line: 165, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
---
> !310 = !{!29, !182, !182, !157}
> !311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !312, file: !92, line: 188)
> !312 = !DISubprogram(name: "wcsncpy", scope: !98, file: !98, line: 92, type: !305, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !314, file: !92, line: 189)
> !314 = !DISubprogram(name: "wcsrtombs", scope: !98, file: !98, line: 344, type: !315, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !315 = !DISubroutineType(types: !316)
> !316 = !{!157, !274, !317, !157, !206}
> !317 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !318)
> !318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
> !319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !320, file: !92, line: 190)
> !320 = !DISubprogram(name: "wcsspn", scope: !98, file: !98, line: 192, type: !289, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !322, file: !92, line: 191)
> !322 = !DISubprogram(name: "wcstod", scope: !98, file: !98, line: 378, type: !323, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !323 = !DISubroutineType(types: !324)
> !324 = !{!325, !181, !326}
> !325 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
> !326 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !327)
> !327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
> !328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !329, file: !92, line: 193)
> !329 = !DISubprogram(name: "wcstof", scope: !98, file: !98, line: 383, type: !330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !330 = !DISubroutineType(types: !331)
> !331 = !{!332, !181, !326}
> !332 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
> !333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !334, file: !92, line: 195)
> !334 = !DISubprogram(name: "wcstok", scope: !98, file: !98, line: 218, type: !335, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !335 = !DISubroutineType(types: !336)
> !336 = !{!169, !171, !181, !326}
> !337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !338, file: !92, line: 196)
> !338 = !DISubprogram(name: "wcstol", scope: !98, file: !98, line: 429, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !339 = !DISubroutineType(types: !340)
> !340 = !{!66, !181, !326, !29}
> !341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !342, file: !92, line: 197)
> !342 = !DISubprogram(name: "wcstoul", scope: !98, file: !98, line: 434, type: !343, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !343 = !DISubroutineType(types: !344)
> !344 = !{!159, !181, !326, !29}
> !345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !346, file: !92, line: 198)
> !346 = !DISubprogram(name: "wcsxfrm", scope: !98, file: !98, line: 135, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !347 = !DISubroutineType(types: !348)
> !348 = !{!157, !171, !181, !157}
> !349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !350, file: !92, line: 199)
> !350 = !DISubprogram(name: "wctob", scope: !98, file: !98, line: 325, type: !351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !351 = !DISubroutineType(types: !352)
> !352 = !{!29, !94}
> !353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !354, file: !92, line: 200)
> !354 = !DISubprogram(name: "wmemcmp", scope: !98, file: !98, line: 259, type: !309, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !356, file: !92, line: 201)
> !356 = !DISubprogram(name: "wmemcpy", scope: !98, file: !98, line: 263, type: !305, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !358, file: !92, line: 202)
> !358 = !DISubprogram(name: "wmemmove", scope: !98, file: !98, line: 268, type: !359, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !359 = !DISubroutineType(types: !360)
> !360 = !{!169, !169, !182, !157}
> !361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !362, file: !92, line: 203)
> !362 = !DISubprogram(name: "wmemset", scope: !98, file: !98, line: 272, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !363 = !DISubroutineType(types: !364)
> !364 = !{!169, !169, !170, !157}
> !365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !366, file: !92, line: 204)
> !366 = !DISubprogram(name: "wprintf", scope: !98, file: !98, line: 602, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
422,489c541,608
< !368 = !{!163, !176, !164}
< !369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !370, file: !86, line: 207)
< !370 = !DISubprogram(name: "wcspbrk", scope: !92, file: !92, line: 202, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !371 = !DISubroutineType(types: !372)
< !372 = !{!163, !176, !176}
< !373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !374, file: !86, line: 208)
< !374 = !DISubprogram(name: "wcsrchr", scope: !92, file: !92, line: 175, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !376, file: !86, line: 209)
< !376 = !DISubprogram(name: "wcsstr", scope: !92, file: !92, line: 213, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !378, file: !86, line: 210)
< !378 = !DISubprogram(name: "wmemchr", scope: !92, file: !92, line: 254, type: !379, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !379 = !DISubroutineType(types: !380)
< !380 = !{!163, !176, !164, !151}
< !381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !382, entity: !383, file: !86, line: 251)
< !382 = !DINamespace(name: "__gnu_cxx", scope: null)
< !383 = !DISubprogram(name: "wcstold", scope: !92, file: !92, line: 385, type: !384, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !384 = !DISubroutineType(types: !385)
< !385 = !{!386, !175, !320}
< !386 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
< !387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !382, entity: !388, file: !86, line: 260)
< !388 = !DISubprogram(name: "wcstoll", scope: !92, file: !92, line: 442, type: !389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !389 = !DISubroutineType(types: !390)
< !390 = !{!391, !175, !320, !23}
< !391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
< !392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !382, entity: !393, file: !86, line: 261)
< !393 = !DISubprogram(name: "wcstoull", scope: !92, file: !92, line: 449, type: !394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !394 = !DISubroutineType(types: !395)
< !395 = !{!396, !175, !320, !23}
< !396 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
< !397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !383, file: !86, line: 267)
< !398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !388, file: !86, line: 268)
< !399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !393, file: !86, line: 269)
< !400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !323, file: !86, line: 283)
< !401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !249, file: !86, line: 286)
< !402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !255, file: !86, line: 289)
< !403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !263, file: !86, line: 292)
< !404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !383, file: !86, line: 296)
< !405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !388, file: !86, line: 297)
< !406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !393, file: !86, line: 298)
< !407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !408, file: !409, line: 66)
< !408 = !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !410, file: !409, line: 97, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
< !409 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/bits/exception_ptr.h", directory: "", checksumkind: CSK_MD5, checksum: "314ad14748ccb9ff85c65d17ebb0828b")
< !410 = !DINamespace(name: "__exception_ptr", scope: !22)
< !411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !410, entity: !412, file: !409, line: 85)
< !412 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !22, file: !409, line: 81, type: !413, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
< !413 = !DISubroutineType(types: !414)
< !414 = !{null, !408}
< !415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !416, file: !409, line: 243)
< !416 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr4swapERNS_13exception_ptrES1_", scope: !410, file: !409, line: 230, type: !417, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !417 = !DISubroutineType(types: !418)
< !418 = !{null, !419, !419}
< !419 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !408, size: 64)
< !420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !421, file: !423, line: 53)
< !421 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !422, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
< !422 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "9fdf0d24f6e4cc61619b5e3258456dbf")
< !423 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/clocale", directory: "")
< !424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !425, file: !423, line: 54)
< !425 = !DISubprogram(name: "setlocale", scope: !422, file: !422, line: 122, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !426 = !DISubroutineType(types: !427)
< !427 = !{!107, !23, !199}
< !428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !429, file: !423, line: 55)
< !429 = !DISubprogram(name: "localeconv", scope: !422, file: !422, line: 125, type: !430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !430 = !DISubroutineType(types: !431)
< !431 = !{!432}
< !432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
< !433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !434, file: !438, line: 64)
< !434 = !DISubprogram(name: "isalnum", scope: !435, file: !435, line: 108, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !435 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "04aab4fba8cc4c824a8f09075cc98b20")
---
> !368 = !{!29, !181, null}
> !369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !370, file: !92, line: 205)
> !370 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !98, file: !98, line: 661, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !372, file: !92, line: 206)
> !372 = !DISubprogram(name: "wcschr", scope: !98, file: !98, line: 165, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !373 = !DISubroutineType(types: !374)
> !374 = !{!169, !182, !170}
> !375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !376, file: !92, line: 207)
> !376 = !DISubprogram(name: "wcspbrk", scope: !98, file: !98, line: 202, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !377 = !DISubroutineType(types: !378)
> !378 = !{!169, !182, !182}
> !379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !380, file: !92, line: 208)
> !380 = !DISubprogram(name: "wcsrchr", scope: !98, file: !98, line: 175, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !382, file: !92, line: 209)
> !382 = !DISubprogram(name: "wcsstr", scope: !98, file: !98, line: 213, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !384, file: !92, line: 210)
> !384 = !DISubprogram(name: "wmemchr", scope: !98, file: !98, line: 254, type: !385, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !385 = !DISubroutineType(types: !386)
> !386 = !{!169, !182, !170, !157}
> !387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !388, entity: !389, file: !92, line: 251)
> !388 = !DINamespace(name: "__gnu_cxx", scope: null)
> !389 = !DISubprogram(name: "wcstold", scope: !98, file: !98, line: 385, type: !390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !390 = !DISubroutineType(types: !391)
> !391 = !{!392, !181, !326}
> !392 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
> !393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !388, entity: !394, file: !92, line: 260)
> !394 = !DISubprogram(name: "wcstoll", scope: !98, file: !98, line: 442, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !395 = !DISubroutineType(types: !396)
> !396 = !{!397, !181, !326, !29}
> !397 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
> !398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !388, entity: !399, file: !92, line: 261)
> !399 = !DISubprogram(name: "wcstoull", scope: !98, file: !98, line: 449, type: !400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !400 = !DISubroutineType(types: !401)
> !401 = !{!402, !181, !326, !29}
> !402 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
> !403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !389, file: !92, line: 267)
> !404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !394, file: !92, line: 268)
> !405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !399, file: !92, line: 269)
> !406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !329, file: !92, line: 283)
> !407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !255, file: !92, line: 286)
> !408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !261, file: !92, line: 289)
> !409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !269, file: !92, line: 292)
> !410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !389, file: !92, line: 296)
> !411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !394, file: !92, line: 297)
> !412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !399, file: !92, line: 298)
> !413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !414, file: !415, line: 66)
> !414 = !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !416, file: !415, line: 97, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
> !415 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/bits/exception_ptr.h", directory: "", checksumkind: CSK_MD5, checksum: "314ad14748ccb9ff85c65d17ebb0828b")
> !416 = !DINamespace(name: "__exception_ptr", scope: !28)
> !417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !416, entity: !418, file: !415, line: 85)
> !418 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !28, file: !415, line: 81, type: !419, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
> !419 = !DISubroutineType(types: !420)
> !420 = !{null, !414}
> !421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !422, file: !415, line: 243)
> !422 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr4swapERNS_13exception_ptrES1_", scope: !416, file: !415, line: 230, type: !423, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !423 = !DISubroutineType(types: !424)
> !424 = !{null, !425, !425}
> !425 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !414, size: 64)
> !426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !427, file: !429, line: 53)
> !427 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !428, line: 51, size: 768, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
> !428 = !DIFile(filename: "/usr/include/locale.h", directory: "", checksumkind: CSK_MD5, checksum: "9fdf0d24f6e4cc61619b5e3258456dbf")
> !429 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/clocale", directory: "")
> !430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !431, file: !429, line: 54)
> !431 = !DISubprogram(name: "setlocale", scope: !428, file: !428, line: 122, type: !432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !432 = !DISubroutineType(types: !433)
> !433 = !{!113, !29, !205}
> !434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !435, file: !429, line: 55)
> !435 = !DISubprogram(name: "localeconv", scope: !428, file: !428, line: 125, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
491,573c610,692
< !437 = !{!23, !23}
< !438 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/cctype", directory: "")
< !439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !440, file: !438, line: 65)
< !440 = !DISubprogram(name: "isalpha", scope: !435, file: !435, line: 109, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !442, file: !438, line: 66)
< !442 = !DISubprogram(name: "iscntrl", scope: !435, file: !435, line: 110, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !444, file: !438, line: 67)
< !444 = !DISubprogram(name: "isdigit", scope: !435, file: !435, line: 111, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !446, file: !438, line: 68)
< !446 = !DISubprogram(name: "isgraph", scope: !435, file: !435, line: 113, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !448, file: !438, line: 69)
< !448 = !DISubprogram(name: "islower", scope: !435, file: !435, line: 112, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !450, file: !438, line: 70)
< !450 = !DISubprogram(name: "isprint", scope: !435, file: !435, line: 114, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !452, file: !438, line: 71)
< !452 = !DISubprogram(name: "ispunct", scope: !435, file: !435, line: 115, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !454, file: !438, line: 72)
< !454 = !DISubprogram(name: "isspace", scope: !435, file: !435, line: 116, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !456, file: !438, line: 73)
< !456 = !DISubprogram(name: "isupper", scope: !435, file: !435, line: 117, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !458, file: !438, line: 74)
< !458 = !DISubprogram(name: "isxdigit", scope: !435, file: !435, line: 118, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !460, file: !438, line: 75)
< !460 = !DISubprogram(name: "tolower", scope: !435, file: !435, line: 122, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !462, file: !438, line: 76)
< !462 = !DISubprogram(name: "toupper", scope: !435, file: !435, line: 125, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !464, file: !438, line: 87)
< !464 = !DISubprogram(name: "isblank", scope: !435, file: !435, line: 130, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !465 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !466, entity: !467, file: !468, line: 58)
< !466 = !DINamespace(name: "__gnu_debug", scope: null)
< !467 = !DINamespace(name: "__debug", scope: !22)
< !468 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/debug/debug.h", directory: "", checksumkind: CSK_MD5, checksum: "752210a319f5f5d356cc29cd1ce3cdc7")
< !469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !470, file: !472, line: 52)
< !470 = !DISubprogram(name: "abs", scope: !471, file: !471, line: 861, type: !436, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !471 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "63eb5d13c95e983b032100a82fad75fa")
< !472 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/bits/std_abs.h", directory: "")
< !473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !474, file: !476, line: 131)
< !474 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !471, line: 63, baseType: !475)
< !475 = !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 59, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
< !476 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/cstdlib", directory: "")
< !477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !478, file: !476, line: 132)
< !478 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !471, line: 71, baseType: !479)
< !479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 67, size: 128, flags: DIFlagTypePassByValue, elements: !480, identifier: "_ZTS6ldiv_t")
< !480 = !{!481, !482}
< !481 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !479, file: !471, line: 69, baseType: !60, size: 64)
< !482 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !479, file: !471, line: 70, baseType: !60, size: 64, offset: 64)
< !483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !484, file: !476, line: 134)
< !484 = !DISubprogram(name: "abort", scope: !471, file: !471, line: 611, type: !485, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
< !485 = !DISubroutineType(types: !486)
< !486 = !{null}
< !487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !488, file: !476, line: 136)
< !488 = !DISubprogram(name: "aligned_alloc", scope: !471, file: !471, line: 605, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !489 = !DISubroutineType(types: !490)
< !490 = !{!149, !151, !151}
< !491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !492, file: !476, line: 138)
< !492 = !DISubprogram(name: "atexit", scope: !471, file: !471, line: 615, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !493 = !DISubroutineType(types: !494)
< !494 = !{!23, !495}
< !495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
< !496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !497, file: !476, line: 141)
< !497 = !DISubprogram(name: "at_quick_exit", scope: !471, file: !471, line: 620, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !499, file: !476, line: 144)
< !499 = !DISubprogram(name: "atof", scope: !500, file: !500, line: 25, type: !501, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !500 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "", checksumkind: CSK_MD5, checksum: "169502ab8f2471cd0f5aaa58bd2e7e49")
< !501 = !DISubroutineType(types: !502)
< !502 = !{!319, !199}
< !503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !504, file: !476, line: 145)
< !504 = !DISubprogram(name: "atoi", scope: !471, file: !471, line: 362, type: !505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !505 = !DISubroutineType(types: !506)
< !506 = !{!23, !199}
< !507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !508, file: !476, line: 146)
< !508 = !DISubprogram(name: "atol", scope: !471, file: !471, line: 367, type: !509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !509 = !DISubroutineType(types: !510)
< !510 = !{!60, !199}
< !511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !512, file: !476, line: 147)
< !512 = !DISubprogram(name: "bsearch", scope: !513, file: !513, line: 20, type: !514, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !513 = !DIFile(filename: "/usr/include/bits/stdlib-bsearch.h", directory: "", checksumkind: CSK_MD5, checksum: "7c3ae5ec6429be5bfb4ff85891cb3fe8")
< !514 = !DISubroutineType(types: !515)
< !515 = !{!149, !516, !516, !151, !151, !518}
< !516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
< !517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
< !518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !471, line: 829, baseType: !519)
< !519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
---
> !437 = !{!438}
> !438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
> !439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !440, file: !444, line: 64)
> !440 = !DISubprogram(name: "isalnum", scope: !441, file: !441, line: 108, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !441 = !DIFile(filename: "/usr/include/ctype.h", directory: "", checksumkind: CSK_MD5, checksum: "04aab4fba8cc4c824a8f09075cc98b20")
> !442 = !DISubroutineType(types: !443)
> !443 = !{!29, !29}
> !444 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/cctype", directory: "")
> !445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !446, file: !444, line: 65)
> !446 = !DISubprogram(name: "isalpha", scope: !441, file: !441, line: 109, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !448, file: !444, line: 66)
> !448 = !DISubprogram(name: "iscntrl", scope: !441, file: !441, line: 110, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !450, file: !444, line: 67)
> !450 = !DISubprogram(name: "isdigit", scope: !441, file: !441, line: 111, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !452, file: !444, line: 68)
> !452 = !DISubprogram(name: "isgraph", scope: !441, file: !441, line: 113, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !454, file: !444, line: 69)
> !454 = !DISubprogram(name: "islower", scope: !441, file: !441, line: 112, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !456, file: !444, line: 70)
> !456 = !DISubprogram(name: "isprint", scope: !441, file: !441, line: 114, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !458, file: !444, line: 71)
> !458 = !DISubprogram(name: "ispunct", scope: !441, file: !441, line: 115, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !460, file: !444, line: 72)
> !460 = !DISubprogram(name: "isspace", scope: !441, file: !441, line: 116, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !462, file: !444, line: 73)
> !462 = !DISubprogram(name: "isupper", scope: !441, file: !441, line: 117, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !464, file: !444, line: 74)
> !464 = !DISubprogram(name: "isxdigit", scope: !441, file: !441, line: 118, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !466, file: !444, line: 75)
> !466 = !DISubprogram(name: "tolower", scope: !441, file: !441, line: 122, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !468, file: !444, line: 76)
> !468 = !DISubprogram(name: "toupper", scope: !441, file: !441, line: 125, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !470, file: !444, line: 87)
> !470 = !DISubprogram(name: "isblank", scope: !441, file: !441, line: 130, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !471 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !472, entity: !473, file: !474, line: 58)
> !472 = !DINamespace(name: "__gnu_debug", scope: null)
> !473 = !DINamespace(name: "__debug", scope: !28)
> !474 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/debug/debug.h", directory: "", checksumkind: CSK_MD5, checksum: "752210a319f5f5d356cc29cd1ce3cdc7")
> !475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !476, file: !478, line: 52)
> !476 = !DISubprogram(name: "abs", scope: !477, file: !477, line: 861, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !477 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "63eb5d13c95e983b032100a82fad75fa")
> !478 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/bits/std_abs.h", directory: "")
> !479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !480, file: !482, line: 131)
> !480 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !477, line: 63, baseType: !481)
> !481 = !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 59, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
> !482 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/13.1.1/../../../../include/c++/13.1.1/cstdlib", directory: "")
> !483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !484, file: !482, line: 132)
> !484 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !477, line: 71, baseType: !485)
> !485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 67, size: 128, flags: DIFlagTypePassByValue, elements: !486, identifier: "_ZTS6ldiv_t")
> !486 = !{!487, !488}
> !487 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !485, file: !477, line: 69, baseType: !66, size: 64)
> !488 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !485, file: !477, line: 70, baseType: !66, size: 64, offset: 64)
> !489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !490, file: !482, line: 134)
> !490 = !DISubprogram(name: "abort", scope: !477, file: !477, line: 611, type: !491, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
> !491 = !DISubroutineType(types: !492)
> !492 = !{null}
> !493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !494, file: !482, line: 136)
> !494 = !DISubprogram(name: "aligned_alloc", scope: !477, file: !477, line: 605, type: !495, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !495 = !DISubroutineType(types: !496)
> !496 = !{!155, !157, !157}
> !497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !498, file: !482, line: 138)
> !498 = !DISubprogram(name: "atexit", scope: !477, file: !477, line: 615, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !499 = !DISubroutineType(types: !500)
> !500 = !{!29, !501}
> !501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
> !502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !503, file: !482, line: 141)
> !503 = !DISubprogram(name: "at_quick_exit", scope: !477, file: !477, line: 620, type: !499, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !505, file: !482, line: 144)
> !505 = !DISubprogram(name: "atof", scope: !506, file: !506, line: 25, type: !507, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !506 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "", checksumkind: CSK_MD5, checksum: "169502ab8f2471cd0f5aaa58bd2e7e49")
> !507 = !DISubroutineType(types: !508)
> !508 = !{!325, !205}
> !509 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !510, file: !482, line: 145)
> !510 = !DISubprogram(name: "atoi", scope: !477, file: !477, line: 362, type: !511, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !511 = !DISubroutineType(types: !512)
> !512 = !{!29, !205}
> !513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !514, file: !482, line: 146)
> !514 = !DISubprogram(name: "atol", scope: !477, file: !477, line: 367, type: !515, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !515 = !DISubroutineType(types: !516)
> !516 = !{!66, !205}
> !517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !518, file: !482, line: 147)
> !518 = !DISubprogram(name: "bsearch", scope: !519, file: !519, line: 20, type: !520, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
> !519 = !DIFile(filename: "/usr/include/bits/stdlib-bsearch.h", directory: "", checksumkind: CSK_MD5, checksum: "7c3ae5ec6429be5bfb4ff85891cb3fe8")
575,579c694,698
< !521 = !{!23, !516, !516}
< !522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !523, file: !476, line: 148)
< !523 = !DISubprogram(name: "calloc", scope: !471, file: !471, line: 556, type: !489, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !525, file: !476, line: 149)
< !525 = !DISubprogram(name: "div", scope: !471, file: !471, line: 873, type: !526, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
---
> !521 = !{!155, !522, !522, !157, !157, !524}
> !522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
> !523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
> !524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !477, line: 829, baseType: !525)
> !525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
581,641c700,760
< !527 = !{!474, !23, !23}
< !528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !529, file: !476, line: 150)
< !529 = !DISubprogram(name: "exit", scope: !471, file: !471, line: 637, type: !530, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
< !530 = !DISubroutineType(types: !531)
< !531 = !{null, !23}
< !532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !533, file: !476, line: 151)
< !533 = !DISubprogram(name: "free", scope: !471, file: !471, line: 568, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !534 = !DISubroutineType(types: !535)
< !535 = !{null, !149}
< !536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !537, file: !476, line: 152)
< !537 = !DISubprogram(name: "getenv", scope: !471, file: !471, line: 654, type: !538, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !538 = !DISubroutineType(types: !539)
< !539 = !{!107, !199}
< !540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !541, file: !476, line: 153)
< !541 = !DISubprogram(name: "labs", scope: !471, file: !471, line: 862, type: !542, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !542 = !DISubroutineType(types: !543)
< !543 = !{!60, !60}
< !544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !545, file: !476, line: 154)
< !545 = !DISubprogram(name: "ldiv", scope: !471, file: !471, line: 875, type: !546, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !546 = !DISubroutineType(types: !547)
< !547 = !{!478, !60, !60}
< !548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !549, file: !476, line: 155)
< !549 = !DISubprogram(name: "malloc", scope: !471, file: !471, line: 553, type: !550, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !550 = !DISubroutineType(types: !551)
< !551 = !{!149, !151}
< !552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !553, file: !476, line: 157)
< !553 = !DISubprogram(name: "mblen", scope: !471, file: !471, line: 943, type: !554, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
< !554 = !DISubroutineType(types: !555)
< !555 = !{!23, !199, !151}
< !556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !557, file: !476, line: 158)
